{
    "microsoft": {
        "url": "https://careers.microsoft.com/students/us/en/search-results",
        "jobs": {
            "Software Engineer Internship Opportunity": {
                "url": "https://careers.microsoft.com/students/us/en/job/1081612/Software-Engineer-Internship-Opportunity",
                "responsibility": "Software Engineering @Microsoft:\n\nRoles & Responsibilities:\n\nSoftware Engineers are primarily responsible for:\n\n• Planning:\no Understanding customer requirements.\no Assisting with project planning, scoping, prioritization.\no Providing estimates;Identifying task ownership.\n\n• Design:\no Creating simple, flexible and comprehensive designs.\no Providing and soliciting design feedback.\n\n• Implementation:\no Writing quality code at source.\no Authoring validation tests; Providing timely issue resolutions.",
                "qualifications": "Eligibility Criteria:\n\n• B. Tech / M. Tech / MS degree in Computer Science or related quantitative field with minimum CGPA of 7.5/10.\n• Ability to write clean, well-crafted code with an emphasis on quality, simplicity, durability, and maintainability.\n• Consider customer’s perspective and experiences when implementing solutions.\n• Demonstrate the ability to deliver tasks on time; also exhibit the ability to adapt to change.\n• Provide estimates; author validation tests; provide timely issue resolutions.\n• Communicate effectively to surface progress, risks and help needed within the project team.\n\nLocations of Operation: Hyderabad, Bangalore, Noida\n\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. \n Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work."
            },
            "Research Intern": {
                "url": "https://careers.microsoft.com/students/us/en/job/931311/Research-Intern",
                "responsibility": "During the internship, students are paired with mentors and expected to collaborate with other interns and researchers, present findings, and contribute to the vibrant life of the community.\nMSR India conducts research in a wide range of areas and Internships are available in all of them.\nIn the application process, we’ll try to find the opportunity that best aligns with your interests.\nInternships are offered year round, though a majority begin in the summer.\nAll internships are paid. And, we’ll help with visa applications where needed.",
                "qualifications": "Candidates must be enroled in a university as part of either a doctoral, masters, or undergraduate program (or must be a recent graduate from such a program). Please include your resume and upto three letters of recommendation while applying for this job.\n Each applicant should request for a letter of recommendation by giving the name and email ID of the referee in the tool. The request will then be routed to the referee to upload a letter of recommendation. Please pay attention to the five areas of research and choose your interest while answering to the screening questions.\n Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.\n Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work."
            },
            "Post Doc Researcher": {
                "url": "https://careers.microsoft.com/students/us/en/job/436026/Post-Doc-Researcher",
                "responsibility": "Post-doctoral researchers must demonstrate innovative work in their field as evidenced by high quality publications, and a track record for innovation. Candidates must also be able to collaborate effectively with other researchers and product development teams. Postdoctoral researchers spend 1 to 2 years at MSR India. During their tenure, each postdoctoral researcher will receive ongoing guidance and mentoring from an experienced researcher at Microsoft Research.\nOur current areas of work range over Algorithms, Machine Learning, Systems (distributed systems, networking, programming languages, security and privacy, cryptography), Human Computer Interaction, and applications of technology to solve societal problems (such as education, health, affordable access to technology). Projects in the lab are inter-disciplinary and span across these research areas",
                "qualifications": "Candidates should have a Ph.D. in Computer Science, Computer Engineering, Electrical Engineering or related fields. Most applicants are recent PhD graduates. Applicants should have  high quality publications, and a good record of innovation and research. Candidates must also be able to collaborate effectively with other researchers and product development teams.\n Interested candidates must apply  with their application materials (including CV, Research Statement, and  contact information of at least three references who can write letters of recommendation). We also encourage applicants to send email to a member of our research staff (whose interest most closely matches theirs) about their application. Our staff webpages can be accessed from Microsoft Research India by browsing through our research interests or by accessing the people page. Applications will be reviewed on an ongoing basis.\n Located in Bengaluru, Microsoft Research India is one of the most attractive places to pursue a research career in computer science and related disciplines. The lab has a vibrant research environment of the highest standard, and a welcoming social life of diversity and international culture. Visit Microsoft Research India for more information on us. \n Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances.\n Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work."
            },
            "Software Engineer Full-Time Opportunity": {
                "url": "https://careers.microsoft.com/students/us/en/job/1072686/Software-Engineer-Full-Time-Opportunity",
                "responsibility": "Software Engineering @Microsoft:\n\nRoles & Responsibilities:\n\nSoftware Engineers are primarily responsible for:\n\n• Planning:\no Understanding customer requirements.\no Assisting with project planning, scoping, prioritization.\no Providing estimates;Identifying task ownership.\n\n• Design:\no Creating simple, flexible and comprehensive designs.\no Providing and soliciting design feedback.\n\n• Implementation:\no Writing quality code at source.\no Authoring validation tests; Providing timely issue resolutions.",
                "qualifications": "Eligibility Criteria:\n\n• B. Tech / M. Tech / MS degree in Computer Science or related quantitative field with minimum CGPA of 7.5/10. Batch of 2022\n• Ability to write clean, well-crafted code with an emphasis on quality, simplicity, durability, and maintainability.\n• Consider customer’s perspective and experiences when implementing solutions.\n• Demonstrate the ability to deliver tasks on time; also exhibit the ability to adapt to change.\n• Provide estimates; author validation tests; provide timely issue resolutions.\n• Communicate effectively to surface progress, risks and help needed within the project team.\n\n\nLocations of Operation: Hyderabad, Bangalore, Noida\n\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. \n Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work."
            },
            "Data Scientist Internship Opportunity": {
                "url": "https://careers.microsoft.com/students/us/en/job/1081651/Data-Scientist-Internship-Opportunity",
                "responsibility": "Roles & Responsibilities:\n\n• Develop highly scalable classifiers, data regression, recommendations and predictive models\n• Analyze petabytes of data and mine patterns from logs\n• Bring data to life using rich visualizations\n• Create language models, speech models, vision models, etc.\n• Suggest, collect and synthesize requirements and innovate to create next generation feature sets.\n• Enable natural and contextual interactions in apps integrating cognitive and analytics services\n• Adapt standard ML methods to best exploit modern parallel environments.\n• Implement algorithms that power user and developer-facing products reaching out to millions of users. Measure and optimize the quality of your algorithms.\n• Work in product teams shipping large scale end to end applications/solutions.",
                "qualifications": "Eligibility Criteria:\n\n• B.Tech / M.Tech/ MS degree in Computer Science or related quantitative field with min. 7.5/10 CGPA.\n• Kaggle score is a plus.\n• Experience with R / Matlab / Scipy / Pandas / Weka, and scripting languages such as Perl, Python.\n• Experience with Hadoop / Hbase / Pig or Mapreduce / Bigtable / AzureML a plus\n• Knowledge of C++, C#, and .NET is a plus.\n\nLocations of Operation:Hyderabad, Bengaluru, Noida\n\n\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. \n Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work."
            },
            "SCAI Centre Fellow": {
                "url": "https://careers.microsoft.com/students/us/en/job/629816/SCAI-Centre-Fellow",
                "responsibility": "The AI Centre Postdoctoral Fellow position at Microsoft Research India offers an opportunity for selected candidates to have a hands-on experience in understanding societal problems, identifying feasible solutions, and dealing with challenges in deploying such solutions. Fellows are expected to contribute to various aspects of a project lifecycle spanning ideation, implementation, evaluation, and deployment. Candidates must also be able to collaborate effectively with other researchers, product development teams and external collaborators.\nPostdoctoral Fellows spend 1 to 2 years at MSR India. During their tenure, each postdoctoral Fellow will receive ongoing guidance and mentoring from an experienced researcher at Microsoft Research.",
                "qualifications": "Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. \n Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work."
            }
        }
    }
}